In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# Chacking empty values

In [4]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

## Use dropna
## drop deck column
##

In [5]:
df = df.deck.dropna(axis=0)

In [6]:
df.isnull().sum()

0

## Remove na from whole datasert

#  Replace na with mean
# using replace function
(age, deck)

# Data Formatting
- Duplicate removel
- Data clenaing
- Data standardization
- Data normalization

(Units are really important in data science)

In [ ]:
#

### *** Data Normalization ***
- Normal data form the bell shaped curve
- unifrom the data to the bell shaped curve
- they have same impact on the data
- Also for computation reasons
- Normalization is used to make data fit in a bell shaped curve

# Method of normalization
- simple feature scaling
- min-max scaling
- z-score (standard score)
- standardization
- Log normalization